package the_message_client;

import javax.swing.text.StyledDocument;

public class CharacterData {

	public static StyledDocument getDoc(String chr, Setting sett) {
		Doc doc = new Doc(sett);
		doc.add(4, chr + "\n\n");
		switch(chr){
		case "老鬼":
			doc.add(1, "就計　");
			doc.add(0, "當你被試探或鎖定時，可以翻開此角色，然後抽二張牌。\n");
			doc.add(1, "城府　");
			doc.add(0, "你被試探時可以隱瞞身分。\n");
			doc.add(1, "遺志　");
			doc.add(0, "當你死亡時，可以把全部手牌面朝下遞給一位玩家，他隨機選擇其中的三張作為情報。\n\n");
			doc.add(3, "機密任務　");
			doc.add(0, "當你死亡時，展示你的手牌，其中有三張或以上的紅色卡牌。");
			break;
		case "老槍":
			doc.add(1, "就計　");
			doc.add(0, "當你被試探或鎖定時，可以翻開此角色，然後抽二張牌。\n");
			doc.add(2, "合謀　");
			doc.add(0, "翻開你的身分牌，然後蓋伏另一位玩家的角色牌。\n\n");
			doc.add(3, "機密任務　");
			doc.add(0, "獲得三張或以上的紅色情報。");
			break;
		case "老金":
			doc.add(1, "棄卒保帥　");
			doc.add(0, "當你的卡牌被識破時，可以翻開此角色牌，抽五張牌，然後把二張手牌按任意順序放回排庫頂。\n");
			doc.add(1, "釜底抽薪　");
			doc.add(0, "當你獲得假情報時，可以再放置一張假情報到自己面前，然後蓋伏此角色牌，並在任意位玩家面前各放置一張情報。\n\n");
			doc.add(3, "機密任務　");
			doc.add(0, "手牌集齊三張紅色卡牌和藍色卡牌。");
			break;
		case "譯電員":
			doc.add(2, "速譯　");
			doc.add(0, "情報傳遞時，可以翻開此角色牌，然後檢視一張傳遞中的情報，並抽一張牌。\n");
			doc.add(1, "洞悉　");
			doc.add(0, "當情報被破譯時，你可以蓋伏此角色牌。\n\n");
			doc.add(3, "機密任務　");
			doc.add(0, "獲得三張或以上的藍色情報。");
			break;
		case "黃雀":
			doc.add(2, "潛藏伏擊　");
			doc.add(0, "翻開此角色牌，然後把另一位玩家面前的一張情報放回牌庫頂。\n");
			doc.add(1, "黃雀在后　");
			doc.add(0, "當另一位玩家死亡時，可以翻開你的身分牌，然後在另一位玩家面前放置最多兩張假情報。\n\n");
			doc.add(3, "機密任務　");
			doc.add(0, "一位潛伏戰線玩家和一位軍情處玩家死亡。");
			break;
		case "黑玫瑰":
			doc.add(2, "血染玫瑰");
			doc.add(0, "翻開此角色牌，指定另一位玩家，然後展示牌庫頂的第一張牌，若那張牌是黑色，你可以在他面前放置最多三張假情報，否則你只能放置一張。\n\n");
			doc.add(3, "機密任務　");
			doc.add(0, "親手讓一位獲得了三張或以上真情報的玩家死亡。");
			break;
		case "鋼鐵特工":
			doc.add(2, "警覺　");
			doc.add(0, "翻開此角色牌，然後視為使用了識破。\n");
			doc.add(1, "掩護　");
			doc.add(0, "你可以獲得另一位玩家面前的一張假情報，然後蓋伏此角色牌。\n\n");
			doc.add(3, "機密任務　");
			doc.add(0, "獲得三張或以上的紅色情報。");
			break;
		case "閃靈":
			doc.add(1, "狙擊　");
			doc.add(0, "翻開此角色牌，然後燒毀另一位玩家面前最多三張情報。\n\n");
			doc.add(3, "機密任務　");
			doc.add(0, "親手讓一位沒有獲得真情報的玩家死亡。");
			break;
		case "浮萍":
			doc.add(2, "先機　");
			doc.add(0, "翻開此角色牌，抽取一位玩家的三張手牌，然後他抽一張牌。\n");
			doc.add(1, "後著　");
			doc.add(0, "當你死亡時，可以檢視另一位玩家的手牌，然後把其中一張放置在一位玩家面前。\n\n");
			doc.add(3, "機密任務　");
			doc.add(0, "你成為第二位或以後死亡的玩家。");
			break;
		case "峨嵋風":
			doc.add(1, "截上截　");
			doc.add(0, "他人回合情報傳遞時，可以翻開此角色牌，然後將一張傳遞置中的情報放置在你面前。\n");
			doc.add(1, "計中計　");
			doc.add(0, "當一位玩家獲得你傳出的真情報時，你可以燒毀他面前一張假情報。\n\n");
			doc.add(3, "機密任務　");
			doc.add(0, "獲得三張或以上的藍色情報。");
			break;
		case "六姐":
			doc.add(1, "拷問　");
			doc.add(0, "當你試探一位玩家時，你可以抽取他的一張手牌。\n");
			doc.add(1, "搜取　");
			doc.add(0, "當一位玩家死亡時，你隨機檢視他的一張手牌，然後可以將該牌加入手牌或做為情報。\n\n");
			doc.add(3, "機密任務　");
			doc.add(0, "獲得六張或以上的情報。");
			break;
		case "大美女":
			doc.add(1, "精明　");
			doc.add(0, "你的抽牌階段改為抽三張牌，然後選擇一張手牌放回牌庫頂。\n");
			doc.add(2, "愛情　");
			doc.add(0, "翻開你的身分牌，然後燒毀二張假情報。\n\n");
			doc.add(3, "機密任務　");
			doc.add(0, "當一位男性角色宣告勝利時，你獲得的假情報少於等於一張。");
			break;
		case "致命香水":
			doc.add(1, "攻守兼備　");
			doc.add(0, "當你使用鎖定或調虎離山時，抽二張牌，然後選擇一張手牌放回牌庫頂。\n");
			doc.add(1, "臨危受命　");
			doc.add(0, "當另一位玩家死亡時，在其翻開身分牌前，你可以把你的身分牌面朝下移出遊戲，然後得到他的身分牌，並且將一位玩家面前的一張情報與牌庫頂第一張牌調換。");
			break;
		case "柒佰":
			doc.add(1, "敏銳　");
			doc.add(0, "你可以在他人回合中使用鎖定。\n");
			doc.add(1, "聯動　");
			doc.add(0, "當你使用鎖定時，抽二張牌，然後選擇一張手牌分給另一位玩家。\n");
			doc.add(1, "風度　");
			doc.add(0, "當你宣告勝利時，選擇一位女性一同勝利。\n\n");
			doc.add(3, "機密任務　");
			doc.add(0, "獲得五張或以上的真情報。");
			break;
		case "禮服蒙面人":
			doc.add(1, "英雄　");
			doc.add(0, "當你獲得假情報時，你可以抽二張牌。\n");
			doc.add(1, "救美　");
			doc.add(0, "2; 當一位女性死亡時，可以翻開你的身分牌，然後燒毀自己與她面前所有的假情報來拯救她。\n\n");
			doc.add(3, "機密任務　");
			doc.add(0, "一位女性宣告勝利。");
			break;
		case "刀鋒":
			doc.add(1, "亮劍　");
			doc.add(0, "你的試探和退回可以當鎖定使用。\n");
			doc.add(1, "嗜血　");
			doc.add(0, "當另一位玩家死亡時，你可以抽四張牌，然後選擇一張手牌分給另一位玩家。\n\n");
			doc.add(3, "機密任務　");
			doc.add(0, "一位潛伏戰線玩家和一位軍情處玩家死亡。");
			break;
		case "小馬哥":
			doc.add(1, "英雄本色　");
			doc.add(0, "當你獲得假情報時，抽一張牌，然後可以在一位玩家面前放置一張假情報。\n\n");
			doc.add(3, "機密任務　");
			doc.add(0, "一位潛伏戰線玩家和一位軍情處玩家死亡。");
			break;
		case "戴笠":
			doc.add(1, "笑裡藏刀　");
			doc.add(0, "當另一位玩家獲得你傳出的真情報時，你可以在他面前放置一張假情報。\n");
			doc.add(1, "運籌帷幄　");
			doc.add(0, "當你獲得真情報時，你可以抽一張牌。\n\n");
			doc.add(3, "機密任務　");
			doc.add(0, "獲得三張或以上的藍色情報。");
			break;
		case "職業殺手":
			doc.add(1, "預謀　");
			doc.add(0, "你的調虎離山可以當作鎖定使用。\n");
			doc.add(1, "連擊　");
			doc.add(0, "當一位玩家獲得你傳出的假情報時，你抽一張牌，然後可以在他面前再放置一張假情報。\n\n");
			doc.add(3, "機密任務　");
			doc.add(0, "親手讓另一位玩家成為第二位或以後死亡的玩家。");
			break;
		case "蝮蛇":
			doc.add(1, "聲東擊西　");
			doc.add(0, "蓋伏此角色牌，然後為使用了調虎離山。\n");
			doc.add(1, "彈藥無限　");
			doc.add(0, "若你沒有手牌，可以翻開此角色牌，然後抽一張牌。\n\n");
			doc.add(3, "機密任務　");
			doc.add(0, "當一位玩家宣告勝利時，沒有玩家死亡。你的勝利會導致他的宣告失敗");
			break;
		case "福爾摩斯":
			doc.add(1, "揭露　");
			doc.add(0, "情報傳遞時，可以丟棄一張黑色手牌，然後翻開一張傳遞中的密電，若為假情報，則抽二張牌。\n");
			doc.add(1, "真相　");
			doc.add(0, "當一位玩家使用試探時，你可以棄一張手牌先檢視該試探。\n\n");
			doc.add(3, "機密任務　");
			doc.add(0, "獲得三張或以上的紅色情報");
			break;
		case "情報處長":
			doc.add(1, "隔牆有耳　");
			doc.add(0, "當你試探一位玩家時，你可以抽二張牌，然後選擇一張手牌放回牌庫頂。\n");
			doc.add(1, "偷龍轉鳳　");
			doc.add(0, "當情報到達你時，你可以丟棄一張手牌，然後將該情報與牌庫頂的第一張牌調換。\n\n");
			doc.add(3, "機密任務　");
			doc.add(0, "獲得三張或以上的紅色情報");
			break;
		case "小白":
			doc.add(1, "喬裝　");
			doc.add(0, "此角色既視為男性也視為女性。\n");
			doc.add(2, "收買　");
			doc.add(0, "把你的四張手牌交給一位玩家，然後獲得他面前的一張情報。\n");
			doc.add(1, "敗露　");
			doc.add(0, "當你獲得六張或以上的情報時，你輸掉這場遊戲。\n\n");
			doc.add(3, "機密任務　");
			doc.add(0, "你成為第一位死亡的玩家，或潛伏戰線與軍情處其中一方全滅。");
			break;
		case "貝雷帽":
			doc.add(1, "換日　");
			doc.add(0, "你的黑色手牌可以當作鎖定使用。\n");
			doc.add(1, "偷天　");
			doc.add(0, "當一位玩家獲得你傳出的假情報時，你可以把他面前的一張真情報加入到任意一位玩家的手牌中。\n\n");
			doc.add(3, "機密任務　");
			doc.add(0, "手牌集齊三張紅色卡牌和藍色卡牌。");
			break;
		case "怪盜九九":
			doc.add(1, "陰謀　");
			doc.add(0, "當另一位玩家獲得你傳出的假情報時，你可以抽取任意一位玩家的一張手牌。\n");
			doc.add(1, "陽謀　");
			doc.add(0, "當你獲得傳出的假情報時，你可以抽取任意一位玩家的一張手牌。\n\n");
			doc.add(3, "機密任務　");
			doc.add(0, "獲得九張或以上的手牌。");
			break;
		}
		return doc.get();
	}
}
